_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ОтветственныеЛица/Ext/RecordSetModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Организация) или Не ЗначениеЗаполнено(запись.Пользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить организацию и ответственное лицо");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
		
		Запрос=Новый Запрос( "ВЫБРАТЬ ПЕРВЫЕ 1
		                     |	СМ_ОтветственныеЛица.ДатаНачала
		                     |ИЗ
		                     |	РегистрСведений.СМ_ОтветственныеЛица КАК СМ_ОтветственныеЛица
		                     |ГДЕ
		                     |	СМ_ОтветственныеЛица.Организация = &Организация
		                     |	И СМ_ОтветственныеЛица.Пользователь = &Пользователь
		                     |	И СМ_ОтветственныеЛица.ДатаОкончания = ДАТАВРЕМЯ(1,1,1)");
		Запрос.УстановитьПараметр("Организация",Запись.Организация);
		Запрос.УстановитьПараметр("Пользователь",Запись.Пользователь);
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пользователь уже является ответственным лицом");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала=ТекущаяДата();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
